# FoCS Project - Solution

*You have to work on the [Kiva](https://drive.google.com/file/d/1-tJtnIbo1Rt-F1XfoWGVkmBXiI-ciuRx/view) dataset. Some information on the datasets are on the [Kaggle](https://www.kaggle.com/) web page.*

## Task 1

*Normalize the `loan_lenders` table. In the normalized table, each row must have one `loan_id` and one lender.*

The first step is to read the `loan_lenders.csv` file and create a dataframe with unnormalized data. Since the file is very large, I introduced a bollean variable `FINAL` - if it is `false` then only a part of data is processed in order to spead up the work. Libraries `panda` and `numpy` will be used for data processing while the efficiency will be measured using the `time` library.

In [1]:
import pandas as pd
import numpy as np
import time as tm
FINAL = False
start_time = tm.time()
loans_lenders_un = pd.read_csv('./data/loans_lenders.csv')
if not FINAL:
    loans_lenders_un = loans_lenders_un.head(10000) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lenders_un

--- 8.029874801635742 seconds ---

      loan_id                                            lenders
0      483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1      483738  muc888, nora3555, williammanashi, barbara5610,...
2      485000  muc888, terrystl, richardandsusan8352, sherri4...
3      486087  muc888, james5068, rudi5955, daniel9859, don92...
4      534428  muc888, niki3008, teresa9174, mike4896, david7...
...       ...                                                ...
9995    45940  helga4707, james6963, jimjams, andreas2382, si...
9996   247491  priyaram, christian9832, john9242, sandra1434,...
9997   345274  priyaram, nicola1093, bobby9744, simon7848, di...
9998   125945  joseph1859, matt5349, reese3555, stanley3312, ...
9999   225434  michael25572458, tom8330, garyk, manas8925, ma...

[10000 rows x 2 columns]

In [2]:
start_time = tm.time()
pairs_loan_lander = []
for index, row in loans_lenders_un.iterrows(): 
    lenders = row['lenders'].split(',')
    for l in lenders:
        pairs_loan_lander.append({ 'loan_id' : row['loan_id'], 'lender': l.strip() })
loans_lenders = pd.DataFrame(pairs_loan_lander) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lenders

--- 3.3072316646575928 seconds ---

        loan_id             lender
0        483693             muc888
1        483693            sam4326
2        483693        camaran3922
3        483693        lachheb1865
4        483693        rebecca3499
...         ...                ...
245000   225434       wongacom3393
245001   225434  marleneanddel8151
245002   225434         joanne4956
245003   225434         juddie7070
245004   225434          keith7215

[245005 rows x 2 columns]

## Task 2

*For each loan, add a column `duration` corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing.*

Firstly, I'll read the `loans.csv` file.

In [3]:
start_time = tm.time()
loans = pd.read_csv('./data/loans.csv')
if not FINAL:
    loans = loans.head(20000)
time = tm.time() -start_time
print("--- %s seconds ---" % time) 
loans

--- 232.84460973739624 seconds ---

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19995,341198,Guillermo Antonio,Spanish,"El Señor Guillermo tiene 42 años, la ubicación...",Guillermo is 42 years old. His business is lo...,375.0,375.0,funded,Shoe Sales,Retail,...,2011-10-13 00:00:41.000 +0000,14.0,10,1,1,NaN,male,true,monthly,field_partner
19996,341771,ERLINDA,English,Erlinda is from the village of Sillawit. She i...,NaN,175.0,175.0,funded,General Store,Retail,...,2011-10-14 06:02:23.000 +0000,8.0,3,2,1,NaN,female,true,irregular,field_partner
19997,344237,Ma Guadalupe,Spanish,La señora Ma Guadalupe es madre de 2 hijos de ...,\r\nMaría Guadalupe is the mother of two child...,625.0,625.0,funded,Property,Housing,...,2011-10-27 19:23:44.000 +0000,14.0,23,1,1,NaN,female,true,monthly,field_partner
19998,344735,Blanca Lidia,Spanish,"Blanca, vive con su esposo, tiene tres hijos d...",Blanca lives with her husband and has three ch...,350.0,350.0,funded,Food Production/Sales,Food,...,2011-10-12 02:10:27.000 +0000,8.0,10,4,2,NaN,female,true,monthly,field_partner
19999,345313,Jackline,English,"Jackline is 30 years old, married, and a moth...",NaN,100.0,100.0,funded,Clothing,Clothing,...,2011-10-17 14:35:09.000 +0000,8.0,1,1,1,NaN,female,true,monthly,field_partner

In order to see the exact titles of the columns and their values I'll do as followes:

In [4]:
loans.columns

Index(['loan_id', 'loan_name', 'original_language', 'description',
       'description_translated', 'funded_amount', 'loan_amount', 'status',
       'activity_name', 'sector_name', 'loan_use', 'country_code',
       'country_name', 'town_name', 'currency_policy',
       'currency_exchange_coverage_rate', 'currency', 'partner_id',
       'posted_time', 'planned_expiration_time', 'disburse_time',
       'raised_time', 'lender_term', 'num_lenders_total',
       'num_journal_entries', 'num_bulk_entries', 'tags', 'borrower_genders',
       'borrower_pictured', 'repayment_interval', 'distribution_model'],
      dtype='object')

In [5]:
loans['planned_expiration_time']

0        2014-02-14 03:30:06.000 +0000
1        2014-03-26 22:25:07.000 +0000
2        2014-02-15 21:10:05.000 +0000
3        2014-02-21 03:10:02.000 +0000
4        2014-02-13 06:10:02.000 +0000
                     ...
19995                              NaN
19996                              NaN
19997                              NaN
19998                              NaN
19999                              NaN
Name: planned_expiration_time, Length: 20000, dtype: object

In [6]:
loans['disburse_time']

0        2013-12-22 08:00:00.000 +0000
1        2013-12-20 08:00:00.000 +0000
2        2014-01-09 08:00:00.000 +0000
3        2014-01-17 08:00:00.000 +0000
4        2013-12-17 08:00:00.000 +0000
                     ...
19995    2011-09-13 07:00:00.000 +0000
19996    2011-09-16 07:00:00.000 +0000
19997    2011-10-07 07:00:00.000 +0000
19998    2011-09-16 07:00:00.000 +0000
19999    2011-09-23 07:00:00.000 +0000
Name: disburse_time, Length: 20000, dtype: object

A `duration` coulmn is created and filled with `None`. 
I'm going now through every row of the dataframe `loans`, and pick the values of the `planned_expiration_time` and `disburse_time`. 
In order to check whether there are missing values I'm using the `pd.notna` method. 
Since in both columns the time is recorded as `str`, a `strptime` method from the `datetime` library is used to transform strings into date-time format. Subsequently, the value of the `disburse_time` is subtracted from the value of the `planned_expiration_time`, and `days` metod gives the value of this difference converted in days. 
Finally, a restricted view of the resulting dataframe is displayed.

In [7]:
from datetime import datetime as dt
start_time = tm.time()
loans['duration'] = None
for index, row in loans.iterrows(): 
    s2 = row['planned_expiration_time']
    s1 = row['disburse_time']
    if( pd.notna(s1) and pd.notna(s2) and s1 != '' and s2 != ''):
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
        loans.loc[index,'duration'] = (d2 - d1).days 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_restricted = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time', 'duration'] ]
loans_restricted

--- 18.299906015396118 seconds ---

,loan_id,loan_name,planned_expiration_time,disburse_time,duration
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,53
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,96
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,37
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,34
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,57
...,...,...,...,...,...
19995,341198,Guillermo Antonio,NaN,2011-09-13 07:00:00.000 +0000,None
19996,341771,ERLINDA,NaN,2011-09-16 07:00:00.000 +0000,None
19997,344237,Ma Guadalupe,NaN,2011-10-07 07:00:00.000 +0000,None
19998,344735,Blanca Lidia,NaN,2011-09-16 07:00:00.000 +0000,None
19999,345313,Jackline,NaN,2011-09-23 07:00:00.000 +0000,None

Hovewer, much efficient way of solving this task is to create an auxilliary function `daysbetween` which transforms input parameters from strings into date-time, and calulate the difference in days. Then the function is applied to each row of the `loans` dataframe.

In [8]:
from datetime import datetime as dt

def daysbetween(s1,s2):
    if( pd.notna(s1) and pd.notna(s2) and s1 != '' and s2 != ''):
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
        return (d2 - d1).days 
    else:
        return None

start_time = tm.time()
loans['duration'] = loans.apply(lambda x: daysbetween(x['disburse_time'],x['planned_expiration_time']), axis=1)
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_restricted = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time', 'duration'] ]
loans_restricted

--- 4.037983179092407 seconds ---

,loan_id,loan_name,planned_expiration_time,disburse_time,duration
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,53.0
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,96.0
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,37.0
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,34.0
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,57.0
...,...,...,...,...,...
19995,341198,Guillermo Antonio,NaN,2011-09-13 07:00:00.000 +0000,NaN
19996,341771,ERLINDA,NaN,2011-09-16 07:00:00.000 +0000,NaN
19997,344237,Ma Guadalupe,NaN,2011-10-07 07:00:00.000 +0000,NaN
19998,344735,Blanca Lidia,NaN,2011-09-16 07:00:00.000 +0000,NaN
19999,345313,Jackline,NaN,2011-09-23 07:00:00.000 +0000,NaN

## Task 3

*Find the lenders that have funded at least twice.*

For this analysis, the dataframe `loans-lenders`, resulting from the first task. Lenders that have corresponding two or more `loan_id` have funded at least twice.

In [9]:
start_time = tm.time()
groups = loans_lenders.groupby("lender").lender.count()
groups
lenders_2more = []
for x in groups.iteritems(): 
    if x[1]  >= 2:
        lenders_2more.append(x)
print("--- %s seconds ---" % (tm.time()-start_time)) 
lenders_2more

--- 3.07442569732666 seconds ---

[('0li', 2),
 ('100ofhumanity1199', 38),
 ('106xin', 2),
 ('10yearitch', 4),
 ('11220', 2),
 ('11familymembers', 3),
 ('123321', 75),
 ('1396', 4),
 ('1880company', 3),
 ('1961', 4),
 ('1968', 2),
 ('1987RDD', 2),
 ('1ghostorchid', 2),
 ('1nottus1', 3),
 ('2000world', 2),
 ('2007', 5),
 ('2008', 2),
 ('20226206', 3),
 ('25894', 3),
 ('25perday', 5),
 ('2checkout', 2),
 ('2composers', 2),
 ('2ndcenterolson7814', 2),
 ('2ndskiesforex', 10),
 ('369', 2),
 ('3Katz', 4),
 ('3beditions', 62),
 ('3ric', 3),
 ('404', 2),
 ('40NewHappy', 3),
 ('45cakes6304', 3),
 ('4729', 3),
 ('4feet2mouths', 6),
 ('4k6089', 2),
 ('70722017', 4),
 ('746416431', 2),
 ('7469', 3),
 ('7thgradeclass5175', 2),
 ('8024693', 2),
 ('82abhilash', 4),
 ('9112', 2),
 ('94704', 70),
 ('9678', 2),
 ('9999', 2),
 ('ACHAIAH', 3),
 ('AMfamilyfund', 4),
 ('AND', 3),
 ('ASVyas512', 2),
 ('AaronRoth', 5),
 ('AdamCohn', 2),
 ('Adjwilley', 8),
 ('Adrion', 3),
 ('AgniPakshi', 2),
 ('AlanMimms', 3),
 ('AmnestyInternationalMHS', 3),
 ('Anayah9514', 2),
 ('Anchor02271967', 4),
 ('AndAboutTimeToo', 18),
 ('AndrewR', 8),
 ('AndyM', 3),
 ('Annej', 2),
 ('ArtBushkin', 34),
 ('ArthurA', 4),
 ('Ashas', 3),
 ('Ashby024543368', 6),
 ('AshleyandTrumon', 2),
 ('AstridVanDerVleut', 33),
 ('AtheistMonkey', 16),
 ('AtoZ', 3),
 ('Avicennasis', 4),
 ('AyamiTogari', 3),
 ('Ayyad', 2),
 ('BEARCREEKNHS', 2),
 ('BadAndy', 3),
 ('BaileyNC', 2),
 ('Bema', 13),
 ('Berry5964', 33),
 ('BigBoss', 5),
 ('Birdman', 57),
 ('Bobbu', 20),
 ('BonesAires', 2),
 ('BrettD', 2),
 ('BrightEyesBigSmiles', 2),
 ('BruceHelping', 2),
 ('BryanMain', 8),
 ('BuYousef', 4),
 ('Buckoclown', 2),
 ('Buffy2005', 2),
 ('CEC', 3),
 ('CGTextures', 8),
 ('CLR', 9),
 ('CRL', 7),
 ('CaliforniaKids', 2),
 ('CamoJ', 6),
 ('CarolGerrish', 2),
 ('CaseyH1963', 2),
 ('CesarMario', 19),
 ('ChavezRuizFamily', 3),
 ('ChloeButler', 2),
 ('ChristopherScholten', 2),
 ('ClaudiaLuna', 2),
 ('Colin9783', 8),
 ('ConorB', 8),
 ('Conrad', 2),
 ('Cybergaukler', 11),
 ('DJKaatSkratch', 3),
 ('DKIG', 7),
 ('DUDES', 3),
 ('DanC', 2),
 ('Darebakus7028', 3),
 ('DasJuden', 3),
 ('Derek9620', 2),
 ('Derrenger', 9),
 ('Desmodus87', 2),
 ('DianeR', 56),
 ('DirkLebe', 23),
 ('DirndlGirl', 2),
 ('Dochas', 3),
 ('DrDarryl', 2),
 ('Dribbler', 3),
 ('Drjuergen', 2),
 ('EGL', 33),
 ('Echelaunch', 3),
 ('EcoAndi', 4),
 ('Eik', 2),
 ('EleLele', 3),
 ('EllensKiva', 3),
 ('Emal', 2),
 ('Emily222', 3),
 ('EnisothaFund', 7),
 ('Entrepreneurs121', 2),
 ('EntrepreneursForAfrica', 51),
 ('EricDamonWalters', 14),
 ('Estella0211', 13),
 ('EthanLizzie', 3),
 ('EvanGates', 7),
 ('FLAME', 12),
 ('FTDWS', 11),
 ('FabianS', 6),
 ('Farmersdaughter', 6),
 ('FightExpiry', 8),
 ('FionaandZac', 2),
 ('FisherFamily', 2),
 ('Floripaoliver', 3),
 ('FrankBliss', 2),
 ('FrankSchwab', 2),
 ('FreeMind', 38),
 ('FrequentMiler', 107),
 ('Fuqua2009Section4', 2),
 ('G76HK', 2),
 ('GPkidsclub', 2),
 ('GailNC', 3),
 ('Gallifante', 3),
 ('Geertjan', 2),
 ('Girl', 13),
 ('GlasgowJ', 8),
 ('Gleddy13', 3),
 ('GlobalDevelopmentProject', 2),
 ('GoldmanSachs', 10),
 ('Grindcore', 5),
 ('GuntherL', 2),
 ('H2O', 2),
 ('HCMB', 3),
 ('HDValentin', 3),
 ('HHorton', 5),
 ('HSVAR', 3),
 ('HakanInGothenburg', 4),
 ('Hamza', 4),
 ('HitProfs', 9),
 ('HoldtCourtClassics', 2),
 ('HtNkiva10508', 2),
 ('HubertWagner', 2),
 ('IHHP', 3),
 ('IanHughes', 2),
 ('Infinite', 2),
 ('InternetSweden', 32),
 ('Ivers0n', 2),
 ('IvicaDen', 9),
 ('JRMorris', 2),
 ('JY1024', 61),
 ('JaM', 3),
 ('Jackelizabeth', 3),
 ('Jaffafamily', 3),
 ('JaimeLynn', 7),
 ('James8528', 2),
 ('JamesCarolynCooper', 3),
 ('JamesH', 2),
 ('JanUitLeiden', 3),
 ('JanaRod', 4),
 ('Janiedoe', 2),
 ('Jeckie', 2),
 ('JeffBrown', 2),
 ('JeffDannenberg', 4),
 ('JennyandPhilipp', 5),
 ('JessieM', 2),
 ('Jib', 2),
 ('Jodi2871', 18),
 ('JoeHale', 4),
 ('JoeandAnna', 2),
 ('JohnC', 3),
 ('JohnDiLucci', 7),
 ('JohnDurovsik', 3),
 ('JonMA', 7),
 ('JonathanCross', 10),
 ('JonathanEarl', 8),
 ('JourneyofJoy', 2),
 ('JuanMary', 2),
 ('JustisM', 3),
 ('K0IBM', 3),
 ('KALLISTI', 9),
 ('KSC1', 6),
 ('KWtransitive', 11),
 ('KamalRautela', 7),
 ('KarenCalvin9009', 3),
 ('Katrina4990', 4),
 ('Keltia2008', 3),
 ('KevinFink', 2),
 ('KevinTimothyBarry', 2),
 ('KirkIreson', 10),
 ('KivaKam', 3),
 ('Kiwi0029', 2),
 ('KristaVanVeen', 2),
 ('KyRoamer', 22),
 ('LTKR', 2),
 ('LakewoodHighSchool', 4),
 ('LashandGoldbergLLP', 2),
 ('LaurierVolunteerNow', 2),
 ('Leah6742', 4),
 ('LeahAndMark', 8),
 ('LendingHands2U', 2),
 ('LeoHChan', 4),
 ('Lieselthetraveler', 3),
 ('Lightlife', 2),
 ('LoisandOliviaFund', 11),
 ('Louie6919', 3),
 ('LouiseG', 6),
 ('LoveandServe', 6),
 ('LovelaceGroup4223', 7),
 ('LutherKiva', 33),
 ('Lutherkent', 9),
 ('MDLN', 3),
 ('MHP', 2),
 ('MJPit06', 2),
 ('MaartenAndLiekeGraveland', 2),
 ('MacKandy', 12),
 ('MafiaReturns', 4),
 ('MakroM', 3),
 ('MarcelD', 2),
 ('MarcoSposato', 6),
 ('MarechalFamily', 11),
 ('MarshWildman', 4),
 ('MartinFamily', 2),
 ('MartinX', 3),
 ('MartyBooth', 7),
 ('MatsSvensson', 2),
 ('MattHurst', 3),
 ('Mattmon', 5),
 ('Mel178', 3),
 ('MessageMedia', 3),
 ('MichaelEmens', 2),
 ('Mirai', 2),
 ('MironProperties', 3),
 ('Mondololloso', 21),
 ('MotivatePeople', 11),
 ('Mpluso', 3),
 ('MrDuncanMike', 10),
 ('MrTsClass', 5),
 ('NINetherlands', 2),
 ('NVHSKAYClub', 2),
 ('NashYielding', 3),
 ('NeedhamHighSchool', 2),
 ('Negleyjj', 3),
 ('Neoluo', 6),
 ('NetScr1be', 3),
 ('Niberkanitz', 3),
 ('NigelleDeDamas', 9),
 ('Nina2439', 2),
 ('Ninetymilesfund', 7),
 ('NoemieD', 11),
 ('Number', 2),
 ('OKImAKiwi', 2),
 ('OPGREMGroup2969', 2),
 ('Oliver10303', 79),
 ('OneWorld', 9),
 ('OnlyUno', 2),
 ('OptimalPayments', 8),
 ('Ottomacho', 13),
 ('P2PMinhNguyen', 12),
 ('P2PMinhNguyen2', 8),
 ('P2PPerpetualFund', 29),
 ('P2PSOSLoanFund', 22),
 ('P2PScottBanister', 11),
 ('PKBanker', 5),
 ('PWR', 4),
 ('ParulRob', 18),
 ('Pastinelli', 4),
 ('PatrickNeuchatel', 12),
 ('PatrikcLundberg', 2),
 ('PaulAndRose', 13),
 ('PaulHvB', 2),
 ('PeaceAcademy', 2),
 ('Pedr0', 22),
 ('PerM', 15),
 ('PeteOn2Wheels', 4),
 ('PramoteHochareon', 3),
 ('PreethaSrini', 9),
 ('ProffyB', 2),
 ('PulkitMathur', 2),
 ('QTIPS', 5),
 ('QueNoFollamos', 2),
 ('RAK', 2),
 ('RandTina', 5),
 ('Ravi9208', 5),
 ('RayandLinda', 5),
 ('ReliableIT', 2),
 ('Rembesha', 2),
 ('Remi', 4),
 ('RichWilliams', 2),
 ('Richardson', 10),
 ('RickHargett', 2),
 ('Ringstad', 3),
 ('RobertGalavan', 2),
 ('RobertKemp', 2),
 ('RobertLewisons', 7),
 ('RobinChen', 2),
 ('RochelleH', 2),
 ('RodSacCaUS', 2),
 ('RogueUniversity', 2),
 ('RonJ1980', 5),
 ('RotaryBerea', 11),
 ('Runhomejack', 2),
 ('SEEDS', 5),
 ('SSSS', 5),
 ('Sabbelbine729', 18),
 ('SaganOmElliot', 2),
 ('SamEllens', 13),
 ('Sami2008', 3),
 ('SandrasMagicPennies', 4),
 ('SanjayMehta', 6),
 ('SarahNelsenDesigns', 2),
 ('Scatandstaff', 3),
 ('ScottG13', 2),
 ('ScottMeier', 3),
 ('Serpthia', 2),
 ('ShawnS', 2),
 ('ShawnTheObvious', 2),
 ('Shay', 6),
 ('SimonB', 6),
 ('SimonGoland', 2),
 ('Sivesgaard', 5),
 ('SjorsLoomans', 2),
 ('Skyring', 3),
 ('SmedleysLenders', 3),
 ('Snak', 46),
 ('SocialVenturesInc', 4),
 ('SocietyofEconomics', 6),
 ('Sonnenbad', 15),
 ('SpartanGlobal', 7),
 ('SydneyAustralia', 3),
 ('TEEXAS', 2),
 ('TGS1982', 3),
 ('TMSMicroBank', 3),
 ('TPO', 3),
 ('Tabrel', 2),
 ('Tati', 9),
 ('TeamLOTUS', 23),
 ('TeamTukul', 2),
 ('TerreCiel', 2),
 ('TheBat', 4),
 ('TheBoreds', 3),
 ('TheBrownFamilyWY', 3),
 ('TheCorrectChange', 8),
 ('TheIndependenceGroup', 2),
 ('TheMcAbeeFamily', 2),
 ('ThibaultWien', 2),
 ('ThierryPasquier', 5),
 ('ThomasV', 4),
 ('Tienson', 2),
 ('TimMcDaniel', 12),
 ('TommyMalthus', 2),
 ('Tony8804', 3),
 ('ULDevSoc', 2),
 ('UUCCH', 8),
 ('UncleBob', 2),
 ('UnionJack26', 2),
 ('Verdad', 23),
 ('VoltairesOptimism', 2),
 ('WCA', 12),
 ('WHYu', 33),
 ('Warpy', 4),
 ('WholelyLeapingSharks', 3),
 ('Woody', 2),
 ('Y3424', 13),
 ('YOyoYOhowsDAjello', 2),
 ('ZaleTabakman', 2),
 ('ZealOtte', 3),
 ('a4agarwal', 2),
 ('aaacamanoheatedst8589', 2),
 ('aad5862', 5),
 ('aagaibi', 2),
 ('aagje7966', 3),
 ('aagot3544', 2),
 ('aamir', 2),
 ('aamir8861', 6),
 ('aamir8970', 5),
 ('aandb2854', 4),
 ('aar', 2),
 ('aaro4456', 2),
 ('aaron1225', 2),
 ('aaron1581', 2),
 ('aaron1782', 2),
 ('aaron1855', 2),
 ('aaron1981', 2),
 ('aaron24648869', 2),
 ('aaron2616', 2),
 ('aaron3015', 21),
 ('aaron3342', 2),
 ('aaron3549', 2),
 ('aaron3710', 2),
 ('aaron3898', 5),
 ('aaron4138', 2),
 ('aaron4336', 2),
 ('aaron4563', 3),
 ('aaron4854', 2),
 ('aaron5081', 2),
 ('aaron5211', 4),
 ('aaron5246', 2),
 ('aaron5492', 2),
 ('aaron5704', 16),
 ('aaron5833', 9),
 ('aaron5912', 3),
 ('aaron6136', 6),
 ('aaron6373', 2),
 ('aaron6473', 3),
 ('aaron6880', 2),
 ('aaron7303', 2),
 ('aaron7498', 5),
 ('aaron75774993', 2),
 ('aaron8110', 2),
 ('aaron8297', 2),
 ('aaron83574977', 134),
 ('aaron88599823', 2),
 ('aaron8935', 2),
 ('aaron9104', 5),
 ('aaron9116', 2),
 ('aaron9226', 2),
 ('aaron9341', 2),
 ('aaron9695', 3),
 ('aaronarnold', 2),
 ('aaronb1', 3),
 ('aaronbrook', 2),
 ('aaronjz', 3),
 ('aaronplaat', 2),
 ('aaronungypants', 9),
 ('aaronw', 2),
 ('aaronz', 2),
 ('aarrieta', 4),
 ('aartjan1757', 25),
 ('aasmund', 2),
 ('ab4226', 4),
 ('abazar', 2),
 ('abbas1321', 2),
 ('abbas4280', 2),
 ('abbas6999', 2),
 ('abbe9543', 3),
 ('abbey1636', 2),
 ('abbey2875', 2),
 ('abbey6528', 2),
 ('abbie2446', 2),
 ('abbie9340', 2),
 ('abbotts', 3),
 ('abby6506', 2),
 ('abby6529', 2),
 ('abby6823', 2),
 ('abdelkabir0', 3),
 ('abdul2596', 2),
 ('abdul6216', 2),
 ('abdulabe4604', 2),
 ('abdulaziz', 7),
 ('abdulaziz7257', 2),
 ('abdulbasit4828', 3),
 ('abdulla6539', 2),
 ('abdullah1027', 5),
 ('abdullah9280', 2),
 ('abdullasaleh', 4),
 ('abdulrafique2698', 13),
 ('abdulrahman8179', 2),
 ('abel4380', 2),
 ('abera3300', 3),
 ('abgrevon7124', 2),
 ('abhijit', 4),
 ('abhijit7371', 2),
 ('abhishek', 6),
 ('abhishek4159', 2),
 ('abhishekbh', 4),
 ('abhishekrungta', 3),
 ('abida5689', 6),
 ('abigail4829', 2),
 ('abigail5580', 2),
 ('abigailevie8830', 2),
 ('abinash7164', 4),
 ('abner5061', 2),
 ('aborange', 3),
 ('abra1903', 2),
 ('abra4016', 2),
 ('abracadoo', 3),
 ('abram8860', 2),
 ('abtar5729', 4),
 ('abu8549', 8),
 ('ac8545', 16),
 ('aca2aps', 6),
 ('acanthusadvisers4015', 6),
 ('acardwelluk', 9),
 ('acarstens', 2),
 ('acbnycgive', 2),
 ('accent', 14),
 ('accident', 2),
 ('accoppell', 3),
 ('acculogisticsllc8128', 3),
 ('ace0', 4),
 ('ace9571', 2),
 ('acelle9394', 3),
 ('acf4564', 7),
 ('acharles8874', 2),
 ('acheng212', 12),
 ('achim3145', 2),
 ('achim3381', 2),
 ('achim9593', 2),
 ('achow', 4),
 ('achraf1590', 3),
 ('achurchill', 5),
 ('acleardirection', 2),
 ('acolin2983', 3),
 ('aconaway', 3),
 ('acorninitiative2295', 9),
 ('act101010', 6),
 ('actioncoach1648', 3),
 ('activate', 2),
 ('activescott', 5),
 ('ad6319', 2),
 ('ad6562', 2),
 ('ad9485', 2),
 ('ada3095', 8),
 ('ada6920', 2),
 ('adacc5009', 4),
 ('adam1375', 4),
 ('adam1607', 4),
 ('adam1653', 2),
 ('adam1735', 2),
 ('adam17793858', 3),
 ('adam18801044', 2),
 ('adam2009', 3),
 ('adam2065', 4),
 ('adam2070', 2),
 ('adam2170', 2),
 ('adam2514', 5),
 ('adam2558', 3),
 ('adam2571', 4),
 ('adam32822109', 2),
 ('adam3477', 2),
 ('adam3505', 4),
 ('adam3579', 2),
 ('adam37173150', 6),
 ('adam3778', 2),
 ('adam3979', 2),
 ('adam4008', 2),
 ('adam4116', 3),
 ('adam42014654', 4),
 ('adam4635', 13),
 ('adam4707', 7),
 ('adam5111', 3),
 ('adam5258', 3),
 ('adam5304', 4),
 ('adam5346', 2),
 ('adam5414', 3),
 ('adam5504', 2),
 ('adam5766', 2),
 ('adam5827', 7),
 ('adam5869', 3),
 ('adam5909', 2),
 ('adam6014', 2),
 ('adam6183', 9),
 ('adam6200', 3),
 ('adam64132584', 3),
 ('adam6486', 3),
 ('adam6552', 2),
 ('adam6868', 2),
 ('adam70423167', 2),
 ('adam7065', 2),
 ('adam71648668', 8),
 ('adam73092556', 3),
 ('adam7342', 5),
 ('adam740', 3),
 ('adam7414', 2),
 ('adam7479', 2),
 ('adam77868494', 3),
 ('adam7930', 2),
 ('adam79608371', 2),
 ('adam8129', 2),
 ('adam8170', 2),
 ('adam8512', 2),
 ('adam8625', 2),
 ('adam8793', 2),
 ('adam9028', 2),
 ('adam9047', 4),
 ('adam9143', 2),
 ('adam9446', 2),
 ('adam9905', 20),
 ('adam9920', 2),
 ('adamandbrooke9292', 2),
 ('adamandchris1770', 2),
 ('adamandmary8619', 2),
 ('adambachman', 4),
 ('adambeebe324', 2),
 ('adamcordle', 3),
 ('adamevers', 2),
 ('adamg9553', 2),
 ('adamgreenberg', 2),
 ('adamholdenbache', 2),
 ('adamk', 2),
 ('adamkwebb', 3),
 ('adammcnamara', 2),
 ('adamps', 4),
 ('adams6990', 2),
 ('adamscottprice', 6),
 ('adana7381', 2),
 ('adaniels85', 4),
 ('adc', 4),
 ('adda1486', 2),
 ('adebruijne', 5),
 ('adeelarif', 2),
 ('adeep', 13),
 ('adel5067', 3),
 ('adel6901', 2),
 ('adel8142', 2),
 ('adelaide9170', 2),
 ('adelayelias', 7),
 ('adele1024', 2),
 ('adele1756', 3),
 ('adele8372', 5),
 ('adella9923', 2),
 ('ademi', 4),
 ('adham7056', 2),
 ('adi6702', 3),
 ('adiipienaar', 14),
 ('adil', 2),
 ('adil6327', 2),
 ('aditya1933', 3),
 ('aditya6814', 4),
 ('adivor', 5),
 ('adnan6215', 2),
 ('adnankhan', 3),
 ('adnanumar', 2),
 ('adolf1500', 3),
 ('adonicus', 9),
 ('adpowers', 2),
 ('adri4414', 2),
 ('adriaan', 3),
 ('adriaan1537', 18),
 ('adriaan1782', 3),
 ('adriaan3711', 3),
 ('adrian0656', 2),
 ('adrian0888', 7),
 ('adrian1779', 3),
 ('adrian1854', 2),
 ('adrian2375', 2),
 ('adrian33391705', 2),
 ('adrian3378', 4),
 ('adrian3747', 5),
 ('adrian4257', 3),
 ('adrian4433', 2),
 ('adrian5483', 2),
 ('adrian5648', 3),
 ('adrian5855', 4),
 ('adrian5951', 3),
 ('adrian6281', 2),
 ('adrian7356', 5),
 ('adrian7968', 2),
 ('adrian8038', 2),
 ('adrian8646', 2),
 ('adrian8803', 4),
 ('adrian9552', 7),
 ('adrian9794', 5),
 ('adriana2107', 2),
 ('adriana5610', 2),
 ('adriana9062', 2),
 ('adriancosmin2579', 2),
 ('adriane1509', 3),
 ('adriangraham', 3),
 ('adrianliston', 2),
 ('adrianna7267', 5),
 ('adrianpt', 2),
 ('adriansalinas', 2),
 ('adrien6546', 2),
 ('adrien6733', 5),
 ('adriendt', 7),
 ('adrienne1736', 2),
 ('adrienne3502', 2),
 ('adrienne5059', 2),
 ('adrienne5742', 2),
 ('adrienne6438', 3),
 ('adrienne6684', 2),
 ('adrienne8703', 2),
 ('advaita', 3),
 ('advancingcompassionp7563', 3),
 ('advantagewireless', 2),
 ('adventurejay', 2),
 ('advocatesforrepeatbo7716', 4),
 ('adworx2834', 2),
 ('adyari1869', 3),
 ('aepconvert', 9),
 ('aerin', 2),
 ('aeu04117', 4),
 ('afalk', 13),
 ('afdesign', 3),
 ('affinity3903', 2),
 ('afroze4263', 9),
 ('afterdarkcookies', 6),
 ('afzal', 4),
 ('agarfors', 2),
 ('agashefamily1601', 5),
 ('age', 2),
 ('agenceleprincenoi3207', 2),
 ('agents4homebuyers', 15),
 ('aggrey', 3),
 ('agmad3071', 2),
 ('agmycroft', 5),
 ('agnes2200', 2),
 ('agnes4783', 2),
 ('agnes5038', 4),
 ('agnes6044', 2),
 ('agnes8285', 2),
 ('agnes9395', 2),
 ('agneta1561', 2),
 ('agnieszka4460', 2),
 ('agnieszka6878', 2),
 ('agnieszka7865', 2),
 ('agoo', 5),
 ('aguila4335', 2),
 ('agustragnar', 3),
 ('aharon7243', 2),
 ('ahmad4538', 2),
 ('ahmad5602', 2),
 ('ahmed1768', 2),
 ('ahmed2259', 2),
 ('ahmed2594', 7),
 ('ahmed5490', 2),
 ('ahmet5494', 2),
 ('ahobbs', 12),
 ('aida3198', 2),
 ('aidan1004', 2),
 ('aidan6013', 11),
 ('aidan6380', 2),
 ('aidan7075', 3),
 ('aidan7592', 4),
 ('aidan8161', 2),
 ('aidan9747', 2),
 ('aiellogianluca', 2),
 ('aigean', 2),
 ('ailcomjane9986', 2),
 ('aileen1194', 3),
 ('aileen2300', 2),
 ('aileen4835', 2),
 ('aileen5496', 2),
 ('aileen6983', 2),
 ('aileen7367', 2),
 ('aili2417', 16),
 ('ailingnat8133', 3),
 ('ailish3143', 2),
 ('ailsa6613', 2),
 ('aim4686', 2),
 ('aiman', 2),
 ('aimee2791', 2),
 ('aimee3175', 2),
 ('aimee4636', 2),
 ('aimee4833', 3),
 ('aimee8311', 2),
 ('aina4954', 2),
 ('airy2792', 2),
 ('aisha1192', 2),
 ('aishaelizabeth0821', 2),
 ('aisj', 2),
 ('aisk', 44),
 ('aisubharath', 4),
 ('aisyear93888', 2),
 ('aj5074', 2),
 ('aj6750', 2),
 ('aj7827', 12),
 ('aj9337', 2),
 ('aj9392', 2),
 ('ajay61634135', 2),
 ('ajay9060', 9),
 ('ajayr', 2),
 ('ajeff7365', 2),
 ('ajh5408', 2),
 ('ajlan1487', 2),
 ('ajmushi', 3),
 ('ajnicholls', 2),
 ('ak1660', 5),
 ('ak2539', 2),
 ('akarman', 8),
 ('akash7076', 2),
 ('akash9973', 3),
 ('akawesley', 43),
 ('akbeancounter', 4),
 ('aki', 2),
 ('akif7633', 2),
 ('akihiro9440', 3),
 ('akiko2146', 3),
 ('akin1521', 2),
 ('akinwunmi9947', 2),
 ('akio6249', 2),
 ('akio8135', 2),
 ('akira6975', 2),
 ('akrita4522', 5),
 ('akshay8463', 2),
 ('aktionclub7654', 2),
 ('aktse', 13),
 ('akuba6049', 2),
 ('al1898', 6),
 ('al3230', 2),
 ('al3675', 3),
 ('al3804', 5),
 ('al3le', 4),
 ('al4832', 5),
 ('al6135', 8),
 ('al6335', 2),
 ('al8509', 2),
 ('alabamasife6533', 3),
 ('aladinodebert', 2),
 ('alain', 6),
 ('alain1740', 11),
 ('alain4072', 2),
 ('alain4775', 4),
 ('alain5707', 2),
 ('alain5721', 2),
 ('alain7701', 2),
 ('alainh', 4),
 ('alainsan', 2),
 ('alan1174', 3),
 ('alan1286', 2),
 ('alan1329', 7),
 ('alan1426', 9),
 ('alan1522', 7),
 ('alan2020', 3),
 ('alan2101', 2),
 ('alan2115', 3),
 ('alan2133', 9),
 ('alan2523', 2),
 ('alan2641', 2),
 ('alan2724', 2),
 ('alan3028', 13),
 ('alan3226', 9),
 ('alan3896', 3),
 ('alan4241', 2),
 ('alan43808041', 4),
 ('alan4436', 4),
 ('alan4525', 2),
 ('alan4706', 2),
 ('alan4828', 2),
 ('alan4840', 2),
 ('alan4935', 2),
 ('alan5063', 3),
 ('alan5317', 4),
 ('alan5330', 2),
 ('alan5431', 2),
 ('alan5513', 62),
 ('alan5695', 2),
 ('alan5840', 6),
 ('alan5965', 3),
 ('alan6091', 3),
 ('alan6237', 2),
 ('alan7126', 2),
 ('alan7387', 3),
 ('alan7447', 2),
 ('alan8273', 3),
 ('alan8321', 2),
 ('alan8582', 2),
 ('alan8663', 2),
 ('alan8790', 2),
 ('alan888', 5),
 ('alan8928', 2),
 ('alan89771321', 3),
 ('alan9324', 2),
 ('alan9572', 4),
 ('alan9652', 2),
 ('alan9682', 2),
 ('alan9726', 2),
 ('alan9746', 2),
 ('alana5756', 2),
 ('alana8130', 5),
 ('alana8131', 2),
 ('alanah8048', 2),
 ('alanandmuriel9786', 2),
 ('alanandsheryl8732', 2),
 ('alancheuk', 2),
 ('alandkindra3601', 7),
 ('alandpat1463', 3),
 ('alanmacdonald', 3),
 ('alanna8524', 2),
 ('alanoud5740', 2),
 ('alanpaulaandlloy2427', 2),
 ('alanvalerie9137', 2),
 ('alarico4160', 2),
 ('alastair3814', 2),
 ('alastair5418', 3),
 ('alastair6897', 2),
 ('alastair9536', 2),
 ('albatros3068', 4),
 ('albert1092', 11),
 ('albert2908', 2),
 ('albert3192', 2),
 ('albert3901', 3),
 ('albert3905', 2),
 ('albert4735', 5),
 ('albert5149', 6),
 ('albert5438', 3),
 ('albert6165', 2),
 ('albert6316', 3),
 ('albert7144', 2),
 ('albert7525', 2),
 ('albert8248', 3),
 ('albert8514', 7),
 ('albert9392', 6),
 ('albert9733', 21),
 ('alberter6185', 3),
 ('alberto1761', 11),
 ('alberto2337', 2),
 ('alberto2851', 3),
 ('alberto3616', 2),
 ('alberto42', 7),
 ('alberto5067', 2),
 ('alberto6371', 2),
 ('alberto8160', 3),
 ('alberto9496', 2),
 ('albertop', 2),
 ('albertw', 2),
 ('albin', 5),
 ('alblazek', 3),
 ('alby4295', 2),
 ('alcida1912', 2),
 ('aldarondo', 3),
 ('aldenrebecca5023', 2),
 ('aldo5926', 2),
 ('aldokurnia', 10),
 ('aldrea16', 2),
 ('ale2992', 3),
 ('alec2763', 2),
 ('alec5212', 8),
 ('alec6584', 2),
 ('alec8941', 5),
 ('alec9180', 7),
 ('alec9937', 4),
 ('aled3498', 2),
 ('alee8508', 2),
 ('aleecat', 3),
 ('alegandron', 2),
 ('alejandro2059', 3),
 ('alejandro2110', 2),
 ('alejandro3131', 2),
 ('alejandro3683', 4),
 ('alejandro4939', 2),
 ('alejandro5210', 2),
 ('alejandro8695', 2),
 ('alek', 4),
 ('aleksa6574', 2),
 ('aleksandr', 2),
 ('aleksandr8290', 2),
 ('aleksandra8526', 2),
 ('aleksip', 2),
 ('alen1278', 14),
 ('alen2517', 2),
 ('alen3271', 2),
 ('alenarui', 3),
 ('alese8429', 2),
 ('alesmith', 4),
 ('alespoon', 3),
 ('alessandra4665', 2),
 ('alessandraelorenzo', 2),
 ('alessandria7512', 2),
 ('alessandro', 3),
 ('alessandro2403', 2),
 ('alessandro3084', 3),
 ('alessandro7532', 3),
 ('alessandro8585', 2),
 ('alessandrorossi', 7),
 ('alessiosalzano', 2),
 ('alethea8384', 3),
 ('alex1257', 2),
 ('alex1401', 2),
 ('alex1473', 3),
 ('alex15256029', 2),
 ('alex1701', 2),
 ('alex1739', 2),
 ('alex18016084', 2),
 ('alex1899', 5),
 ('alex19705929', 2),
 ('alex2189', 2),
 ('alex2351', 2),
 ('alex2422', 2),
 ...]

## Task 4

*For each country, compute how many loans have involved that country as borrowers.*

From the dataframe `loans` I'm grouping by `country_name` and counting the `loan_id`.

In [10]:
start_time = tm.time()
countries = loans.groupby("country_name").country_name.count()
print("--- %s seconds ---" % (tm.time()-start_time)) 
countries

--- 0.0050182342529296875 seconds ---

country_name
Afghanistan       12
Albania           50
Armenia          212
Azerbaijan       109
Belize             4
                ...
United States     55
Vietnam          309
Yemen             88
Zambia            18
Zimbabwe          91
Name: country_name, Length: 78, dtype: int64

## Task 5

*For each country, compute the overall amount of money borrowed.*

Again, the dataframe `loans` is processed. After grouping by `country_name`, the `loan_amount` is summed.

In [11]:
start_time = tm.time()
amount_per_country = loans.groupby("country_name").loan_amount.sum()
print("--- %s seconds ---" % (tm.time()-start_time)) 
amount_per_country

--- 1.3081724643707275 seconds ---

country_name
Afghanistan       11625.0
Albania           69800.0
Armenia          371075.0
Azerbaijan       205675.0
Belize             4850.0
                   ...
United States    294625.0
Vietnam          377700.0
Yemen             92100.0
Zambia            32650.0
Zimbabwe          92700.0
Name: loan_amount, Length: 78, dtype: float64

## Task 6

*Like the previous point, but expressed as a percentage of the overall amount lent*

First the total amount is calculated. A helper function `calculate_percent` is created in order to calculate the percentage `loan_amount/total_amount*100`, and it is then applied to each row of the series `amount_per_country`.

In [12]:
start_time = tm.time()
total_amount = loans.loan_amount.sum()

def calculate_percent(v):
    return (v / total_amount) * 100

percentage_per_country= amount_per_country.apply(lambda x: calculate_percent(x))
print("--- %s seconds ---" % (tm.time()-start_time)) 
percentage_per_country

--- 1.143559217453003 seconds ---

country_name
Afghanistan      0.069063
Albania          0.414677
Armenia          2.204531
Azerbaijan       1.221901
Belize           0.028814
                   ...
United States    1.750347
Vietnam          2.243890
Yemen            0.547160
Zambia           0.193971
Zimbabwe         0.550724
Name: loan_amount, Length: 78, dtype: float64

## Task 7

*Like the three previous points, but split for each year (with respect to disburse time).*

Firstly, an auxiliary function `year2` is made in order to enable extracting year from the date.  Subsequently this function is applied on each row of the `loans` dataframe enabling creation of new coulmn `disburse_year`.

In [13]:
start_time = tm.time()
from datetime import datetime as dt
def year2 (s):
    if( pd.notna(s) and s != ''):
        d = dt.strptime(s, "%Y-%m-%d %H:%M:%S.%f %z")
        return d.year
    return None
    
loans["disburse_year"] = loans.disburse_time.map(lambda x: year2(x))
loans

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration,disburse_year
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,3,2,1,NaN,female,true,irregular,field_partner,53.0,2013
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,11,2,1,NaN,female,true,monthly,field_partner,96.0,2013
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,37.0,2014
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,21,2,1,user_favorite,female,true,monthly,field_partner,34.0,2014
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,57.0,2013
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19995,341198,Guillermo Antonio,Spanish,"El Señor Guillermo tiene 42 años, la ubicación...",Guillermo is 42 years old. His business is lo...,375.0,375.0,funded,Shoe Sales,Retail,...,10,1,1,NaN,male,true,monthly,field_partner,NaN,2011
19996,341771,ERLINDA,English,Erlinda is from the village of Sillawit. She i...,NaN,175.0,175.0,funded,General Store,Retail,...,3,2,1,NaN,female,true,irregular,field_partner,NaN,2011
19997,344237,Ma Guadalupe,Spanish,La señora Ma Guadalupe es madre de 2 hijos de ...,\r\nMaría Guadalupe is the mother of two child...,625.0,625.0,funded,Property,Housing,...,23,1,1,NaN,female,true,monthly,field_partner,NaN,2011
19998,344735,Blanca Lidia,Spanish,"Blanca, vive con su esposo, tiene tres hijos d...",Blanca lives with her husband and has three ch...,350.0,350.0,funded,Food Production/Sales,Food,...,10,4,2,NaN,female,true,monthly,field_partner,NaN,2011
19999,345313,Jackline,English,"Jackline is 30 years old, married, and a moth...",NaN,100.0,100.0,funded,Clothing,Clothing,...,1,1,1,NaN,female,true,monthly,field_partner,NaN,2011

### Task 7.1

*For each country, compute how many loans have involved that country as borrowers per year.*

In [14]:
start_time = tm.time()
countries_per_year = loans.groupby(["country_name", "disburse_year"]).country_name.count()
countries_per_year
print("--- %s seconds ---" % (tm.time()-start_time)) 
countries_per_year

--- 1.4596352577209473 seconds ---

country_name  disburse_year
Afghanistan   2009             11
              2010              1
Albania       2012              5
              2013             15
              2014             16
                               ..
Zimbabwe      2013              9
              2014             47
              2015              9
              2016              7
              2017             12
Name: country_name, Length: 519, dtype: int64

### Task 7.2

*For each country, compute the overall amount of money borrowed per year.*

In [15]:
amount_per_country_per_year = loans.groupby(["country_name","disburse_year"]).loan_amount.sum()
amount_per_country_per_year

country_name  disburse_year
Afghanistan   2009             10450.0
              2010              1175.0
Albania       2012              4250.0
              2013             19150.0
              2014             27225.0
                                ...
Zimbabwe      2013             16450.0
              2014             31200.0
              2015              9150.0
              2016              8950.0
              2017             13300.0
Name: loan_amount, Length: 519, dtype: float64

### Task 7.3

*Like the previous point, but expressed as a percentage of the overall amount lent per year.*

Firstly, `total_amount_per_year` is calculated.

In [16]:
total_amount_per_year = loans.groupby("disburse_year").loan_amount.sum()
total_amount_per_year

disburse_year
2007        200.0
2009     914050.0
2010     522125.0
2011     816025.0
2012    2115475.0
2013    4052325.0
2014    3427300.0
2015    1430500.0
2016    1318650.0
2017    2224975.0
2018      10750.0
Name: loan_amount, dtype: float64

An auxiliary function `find_total_per_year` is created in order to enable accessing the total amounts for each year, needed later to calculate the percentage. 
We iterate through `amount_per_country_per_year`, extract the loan amounts grouped by country and year, anc calculate the percentage. As a result, there is a list of dictionaries then converted in dataframe.

In [17]:
def find_total_per_year(y):
    for x in total_amount_per_year.items():
        if x[0] == y:
            return x[1]
    return 0

result = []
start_time = tm.time()
for x in amount_per_country_per_year.items():
    v = x[1]
    y = x[0][1]
    c = x[0][0]
    tot = find_total_per_year(y)
    perc = (v / tot) * 100
    result.append({"country_name":c, "disburse_year":y, "percent":perc })
result = pd.DataFrame(result)
print("--- %s seconds ---" % (tm.time()-start_time)) 
result

--- 0.5856130123138428 seconds ---

    country_name  disburse_year   percent
0    Afghanistan           2009  1.143263
1    Afghanistan           2010  0.225042
2        Albania           2012  0.200901
3        Albania           2013  0.472568
4        Albania           2014  0.794357
..           ...            ...       ...
514     Zimbabwe           2013  0.405940
515     Zimbabwe           2014  0.910338
516     Zimbabwe           2015  0.639636
517     Zimbabwe           2016  0.678724
518     Zimbabwe           2017  0.597760

[519 rows x 3 columns]

## Task 8

*For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount*

Two dataframes, `loans` and `loans_lenders` are merged.
The resulting dataframe `number_of_lenders_by_loan_id` has the number of lenders per each loan.
The amount per lender is calculated assuming ttah each lender contributed the same to the loan amount. 
Finally, in order to obtain the total sum per lender, the dataframe is gro

In [18]:
start_time = tm.time()
merged = pd.merge(left=loans_lenders,right=loans, left_on="loan_id", right_on="loan_id")
merged = merged[["loan_id","lender", "loan_amount"]]
number_of_lenders_by_loan_id = merged.groupby(["loan_id"], as_index = False)[["lender"]].count()
number_of_lenders_by_loan_id
merged2 = pd.merge(left=merged,right=number_of_lenders_by_loan_id, left_on="loan_id", right_on="loan_id")
merged2["amount_per_lender"] = merged2.loan_amount / merged2.lender_y
merged2
lent_by_lender = merged2.groupby(["lender_x"], as_index = False)[["amount_per_lender"]].sum()
print("--- %s seconds ---" % (tm.time()-start_time)) 
lent_by_lender

--- 20.798378229141235 seconds ---

                lender_x  amount_per_lender
0      100ofhumanity1199          64.583333
1             10yearitch          33.876812
2                 123321         153.990193
3           1ghostorchid          31.097561
4               1nottus1          43.750000
...                  ...                ...
19663         zubair1627          41.233766
19664              zubin         104.088235
19665               zuzu          25.714286
19666               zxdr          32.500000
19667           zzmcfate         196.912312

[19668 rows x 2 columns]

## Task 9

*For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.*

The file `lenders.csv` contains data related to lenders. `lender_states` is a newely created dataframe containing `country_code` and `permanent_name`.

In [19]:
start_time = tm.time()
lenders = pd.read_csv("./data/lenders.csv")
if not FINAL:
    lenders = lenders.head(20000) 
lender_states = lenders[["permanent_name","country_code"]]
print("--- %s seconds ---" % (tm.time()-start_time)) 
lender_states

--- 46.39687728881836 seconds ---

           permanent_name country_code
0                qian3013          NaN
1               reena6733          NaN
2                 mai5982          NaN
3          andrew86079135          NaN
4              nguyen6962          NaN
...                   ...          ...
19995         mohamed4338          NaN
19996  vicrennaisance8567          NaN
19997           mariz6787          NaN
19998          julian2868          NaN
19999         lestine1570          NaN

[20000 rows x 2 columns]

The dataframe `lenders_in_states` contains data related to lenders whose country is known.

In [20]:
lenders_in_states = lender_states.loc[lender_states['country_code'].notnull()]
lenders_in_states

          permanent_name country_code
16            naresh2074           US
31     christina27976796           US
37             vikas1098           IN
39              qian1385           US
42              xigg8769           US
...                  ...          ...
19979        manrike5051           LA
19981         janell3482           US
19984         sheryl2462           US
19989            amy5291           US
19993          gokul8235           US

[3424 rows x 2 columns]

The dataframe `lenders_without_states` contains data related to lenders whose country is unknown or the data is missing.

In [21]:
lenders_without_states = lender_states.loc[lender_states["country_code"].isnull()]
lenders_without_states

           permanent_name country_code
0                qian3013          NaN
1               reena6733          NaN
2                 mai5982          NaN
3          andrew86079135          NaN
4              nguyen6962          NaN
...                   ...          ...
19995         mohamed4338          NaN
19996  vicrennaisance8567          NaN
19997           mariz6787          NaN
19998          julian2868          NaN
19999         lestine1570          NaN

[16576 rows x 2 columns]

In order to calculate the participation of each country in total amount of lent loans, the following calculation is done:

In [22]:
start_time = tm.time()
lent_and_state = pd.merge(left=lent_by_lender, right=lenders_in_states, left_on='lender_x', right_on='permanent_name')
lent_total = lent_and_state['amount_per_lender'].sum()
lent_by_state = lent_and_state.groupby(['country_code'], as_index = False\
                                      ).agg({'amount_per_lender':['count', 'sum', \
                                                               lambda x: x.sum()/lent_total]})
lent_by_state.columns = ['country_code', 'lent_count', 'lent_sum', 'lent_factor']
print("--- %s seconds ---" % (tm.time()-start_time)) 
lent_by_state

--- 1.1097071170806885 seconds ---

  country_code  lent_count   lent_sum  lent_factor
0           AU           1  33.333333     0.431034
1           US           1  44.000000     0.568966

Total amount of lent money for the lenders with unknown/unavailable country is being calculated

In [23]:
lent_no_state = pd.merge(left=lent_by_lender, right=lenders_without_states, \
                         left_on='lender_x', right_on='permanent_name')
lent_no_state_total = lent_no_state['amount_per_lender'].sum()
lent_no_state_total

305.0

This amount is factorized as previously calculated, and added to `lent_by_state` datafrime as requested in the task.

In [24]:
lent_by_state['additional_lent'] = lent_by_state.lent_factor * lent_no_state_total
lent_by_state

  country_code  lent_count   lent_sum  lent_factor  additional_lent
0           AU           1  33.333333     0.431034       131.465517
1           US           1  44.000000     0.568966       173.534483

`loan_and_state` is the dataframe obtained by reducing the `loans` dataframe to the following three columns:

In [25]:
loan_and_state = loans[['loan_id','country_code','loan_amount']]
loan_and_state

       loan_id country_code  loan_amount
0       657307           PH        125.0
1       657259           HN        400.0
2       658010           PK        400.0
3       659347           KG        625.0
4       656933           PH        425.0
...        ...          ...          ...
19995   341198           NI        375.0
19996   341771           PH        175.0
19997   344237           MX        625.0
19998   344735           SV        350.0
19999   345313           KE        100.0

[20000 rows x 3 columns]

The loan amount per contry is calculated.

In [26]:
start_time = tm.time()
loan_by_state = loan_and_state.groupby(['country_code'], as_index = False).loan_amount.sum()
loan_by_state.columns = ['country_code','loan_amount_sum']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loan_by_state

--- 0.003984212875366211 seconds ---

   country_code  loan_amount_sum
0            AF          11625.0
1            AL          69800.0
2            AM         371075.0
3            AZ         205675.0
4            BA            575.0
..          ...              ...
73           XK          74950.0
74           YE          92100.0
75           ZA          29000.0
76           ZM          32650.0
77           ZW          92700.0

[78 rows x 2 columns]

Two data frames relating to loaned and lent amounts per country are joined (left join since there are much more loans), the difference is calculated and finally, the entry with maximum difference is displayed.

In [27]:
start_time = tm.time()
loan_and_lent = pd.merge(loan_by_state, lent_by_state, how='left', on=['country_code'])
loan_and_lent['difference'] = loan_and_lent.loan_amount_sum - loan_and_lent.lent_sum - loan_and_lent.additional_lent 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loan_and_lent[loan_and_lent.difference == loan_and_lent.difference.max()]

--- 0.16536235809326172 seconds ---

,country_code,loan_amount_sum,lent_count,lent_sum,lent_factor,additional_lent,difference
70,US,294625.0,1.0,44.0,0.568966,173.534483,294407.465517

## Task 10

*Which country has the highest ratio between the difference computed at the previous point and the population?*

The data related to population are contained in the file `country_stat.csv`

In [28]:
start_time = tm.time()
country_stat = pd.read_csv('./data/country_stats.csv')
country_stat = country_stat[['country_code', 'country_name', 'population', 'population_below_poverty_line']]
country_stat = country_stat.dropna(subset=['population_below_poverty_line'])
print("--- %s seconds ---" % (tm.time()-start_time)) 
country_stat

--- 0.5335147380828857 seconds ---

    country_code  country_name  population  population_below_poverty_line
0             IN         India  1339180127                           21.9
1             NG       Nigeria   190886311                           70.0
2             MX        Mexico   129163276                           46.2
3             PK      Pakistan   197015955                           29.5
4             BD    Bangladesh   164669751                           31.5
..           ...           ...         ...                            ...
147           MT         Malta      430835                           16.3
148           MV      Maldives      436330                           16.0
149           ME    Montenegro      628960                            8.6
150           TM  Turkmenistan     5758075                            0.2
173           XK        Kosovo     1895250                           30.0

[152 rows x 4 columns]

A new dataframe `country_stat_loan_and_lent` is created by joining the `country_stat` and `loan_and_lent` dataframes on `country_code` column. `ratio_1` is calculated by dividing previously obtained difference and the population. Subsequentlt the country with the maximum ratio is selected.

In [29]:
country_stat_loan_and_lent = pd.merge(left=country_stat, right=loan_and_lent, \
                                      left_on='country_code', right_on='country_code')
country_stat_loan_and_lent = country_stat_loan_and_lent[['country_code', 'country_name', 'difference', \
                                                         'population', 'population_below_poverty_line']]
country_stat_loan_and_lent['ratio_1'] = country_stat_loan_and_lent.difference/country_stat_loan_and_lent.population
print("--- %s seconds ---" % (tm.time()-start_time)) 
country_stat_loan_and_lent[country_stat_loan_and_lent.ratio_1 == country_stat_loan_and_lent.ratio_1.max()]

--- 0.6650853157043457 seconds ---

,country_code,country_name,difference,population,population_below_poverty_line,ratio_1
5,US,United States,294407.465517,324459463,15.1,0.000907

## Task 11

*Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?*

Firstly, the population that is not below the poverty line is calculated using the percentage of population below poverty line and the population. 
`ratio_2` is calculated by dividing the difference by population that is not below the poverty line and the country with the hihgest ratio is selected.

In [31]:
start_time = tm.time()
#country_stat_loan_and_lent = pd.merge(left=country_stat, right=loan_and_lent, \
                                      #left_on='country_code', right_on='country_code')
#country_stat_loan_and_lent = country_stat_loan_and_lent[['country_code', 'country_name', 'difference', \
                                                         #'population', 'population_below_poverty_line']]
country_stat_loan_and_lent['ratio_2'] = country_stat_loan_and_lent.difference\
/(country_stat_loan_and_lent.population * ((100-country_stat_loan_and_lent.population_below_poverty_line)/100) )
print("--- %s seconds ---" % (tm.time()-start_time)) 
country_stat_loan_and_lent[country_stat_loan_and_lent.ratio_2 == country_stat_loan_and_lent.ratio_2.max()]

--- 0.0009984970092773438 seconds ---

,country_code,country_name,difference,population,population_below_poverty_line,ratio_2
5,US,United States,294407.465517,324459463,15.1,0.001069

## Task 12

*For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.*

Two auxiliary functions are made: 
`days_in_year` calculate number of days in each year froma cartain point in time. 

`total_amount_of_loans`calculate the payment plan for **one loan** over the years as requested in the task.

In [32]:
start_time = tm.time()

from datetime import datetime as dt, timezone as tz

now = dt.now(tz.utc)

def days_in_year(year):
    d1 = dt.strptime( str(year)+'-01-01', "%Y-%m-%d") 
    d1 = d1.replace(tzinfo=None)
    d2 = dt.strptime( str(year)+'-12-31', "%Y-%m-%d")
    d2 = d2.replace(tzinfo=None)
    return (d2-d1).days+1

def total_amount_of_loans(disb, plan_exp, amount):
    if( disb.year == plan_exp.year ):
        return [(disb.year,amount)]
    disb = disb.replace(tzinfo=None)
    plan_exp = plan_exp.replace(tzinfo=None) 
    total_days = (plan_exp-disb).days 
    total_days += 1
    total_amount = []
    curr = disb
    curr = curr.replace(tzinfo=None)
    for y in range(disb.year, plan_exp.year):
        dy = (dt.strptime(str(y)+'-12-31',"%Y-%m-%d").replace(tzinfo=None)-curr).days + 1
        if(total_days >0):
            total_amount.append( (y, dy * amount / total_days) )
        else:
            total_amount.append( (y, 0) )
        curr = dt.strptime(str(y+1)+'-01-01',"%Y-%m-%d")
        curr = curr.replace(tzinfo=None)
    dy = (plan_exp-curr).days + 1
    if(total_days >0):
        total_amount.append( (plan_exp.year, dy * amount / total_days) )
    else:
        total_amount.append( (plan_exp.year,0) )
    return total_amount

d_t = dt.strptime( '2016-12-01', "%Y-%m-%d")
p_e_t = dt.strptime( '2018-01-30', "%Y-%m-%d")
total_amount_of_loans(d_t, p_e_t, 5000)

[(2016, 363.84976525821594),
 (2017, 4284.037558685446),
 (2018, 352.11267605633805)]

A restricted loan dataframe is created containing anly the necessary data.

In [33]:
loans_base = loans[['loan_id','loan_name','loan_amount','planned_expiration_time','disburse_time']]
loans_base

,loan_id,loan_name,loan_amount,planned_expiration_time,disburse_time
0,657307,Aivy,125.0,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000
1,657259,Idalia Marizza,400.0,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000
2,658010,Aasia,400.0,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000
3,659347,Gulmira,625.0,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000
4,656933,Ricky\t,425.0,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000
...,...,...,...,...,...
19995,341198,Guillermo Antonio,375.0,NaN,2011-09-13 07:00:00.000 +0000
19996,341771,ERLINDA,175.0,NaN,2011-09-16 07:00:00.000 +0000
19997,344237,Ma Guadalupe,625.0,NaN,2011-10-07 07:00:00.000 +0000
19998,344735,Blanca Lidia,350.0,NaN,2011-09-16 07:00:00.000 +0000
19999,345313,Jackline,100.0,NaN,2011-09-23 07:00:00.000 +0000

The `loans_base` dataframe is iterated, and the two previously created functions are applied in order to btain the payment plan over the years. A new dataframe containing the payment plan per year (column `amount`) is created.

In [34]:
lis = []
for index, row in loans_base.iterrows():
    s2 = row['planned_expiration_time']
    try:
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
    except ValueError:
        continue
    except TypeError:
        continue
    s1 = row['disburse_time']
    try:
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
    except ValueError:
        continue
    except TypeError:
        continue
    try:
        amt = float(row['loan_amount'])
    except ValueError:
        continue
    except TypeError:
        continue
    ls = total_amount_of_loans(d1, d2, amt)
    for l in ls:
        lis.append({ 'loan_id' : row['loan_id'], 'loan_name': row['loan_name'], 'loan_amount': row['loan_amount'], \
                    'planned_expiration_time': row['planned_expiration_time'], \
                    'disburse_time': row['disburse_time'],'year': l[0], 'ammount':l[1] })
loans_final = pd.DataFrame(lis) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_final

--- 638.949399471283 seconds ---

,loan_id,loan_name,loan_amount,planned_expiration_time,disburse_time,year,ammount
0,657307,Aivy,125.0,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2013,20.833333
1,657307,Aivy,125.0,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014,104.166667
2,657259,Idalia Marizza,400.0,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2013,45.360825
3,657259,Idalia Marizza,400.0,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014,350.515464
4,658010,Aasia,400.0,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014,400.000000
...,...,...,...,...,...,...,...
19962,971438,CHHON,1300.0,2015-12-01 02:00:03.000 +0000,2015-10-02 07:00:00.000 +0000,2015,1300.000000
19963,1267448,Khen's Group,100.0,2017-05-01 18:50:04.000 +0000,2017-03-21 07:00:00.000 +0000,2017,100.000000
19964,1268098,Hieu,900.0,2017-05-17 19:50:05.000 +0000,2017-03-22 07:00:00.000 +0000,2017,900.000000
19965,1268162,Hussain,2000.0,2017-05-02 22:20:02.000 +0000,2017-03-21 07:00:00.000 +0000,2017,2000.000000
19966,1268236,Ran's Group,1075.0,2017-05-02 22:50:06.000 +0000,2017-03-21 07:00:00.000 +0000,2017,1075.000000